Revit.Elements.RoofType
A Revit RoofType

Revit.Elements.RoofType.InternalRoofType
An internal reference to the RoofType

Revit.Elements.RoofType.InternalElement
Reference to the Element

Revit.Elements.RoofType.#ctor(Autodesk.Revit.DB.RoofType)
Private constructor for the Element
roofType:

Revit.Elements.RoofType.InitRoofType(Autodesk.Revit.DB.RoofType)
Initialize a RoofType element
roofType:

Revit.Elements.RoofType.InternalSetRoofType(Autodesk.Revit.DB.RoofType)
Set the RoofType property, element id, and unique id
RoofType:

Revit.Elements.RoofType.Name
The name of the RoofType

Revit.Elements.RoofType.ByName(System.String)
Select a RoofType from the document given
name:
Returns:

Revit.Elements.RoofType.FromExisting(Autodesk.Revit.DB.RoofType,System.Boolean)
Create a RoofType from a user selected Element.
RoofType:
isRevitOwned:
Returns: